while - один из самых универсальных циклов в Python, поэтому довольно медленный. Выполняет тело цикла до тех пор, пока условие цикла истинно.
```
i = 5
while i < 15:
    print(i)
    i = i + 2
```

Например, пока количество игроков на хоккейном поле менее или равно 6, должны выполняться какие-то циклические команды. То есть все команды выполняются по кругу, пока выражение истинное. Как только количество игроков будет более 6, выражение станет ложным и Питон остановит цикл, перейдя к следующей строке кода.
 
Практический пример
```
igrok = 1
while igrok >= 1 and igrok <= 6:
    print("Сейчас на поле»)
    print(igrok)
    print(“игрок(ов)”)
    igrok = igrok + 1
```

### Краткое пояснение к коду
Сначала мы вводим переменную в код под названием igrok. Присваиваем ей значение: 1
Далее создаем пустой список с игроками.
Далее начинаем цикл while. Пока значение нашей переменной более или равно 1 и менее или равно 6, выполняем следующие команды:
•	напечатаем текст, сколько сначала на поле игроков
•	далее увеличим число игроков на одного.


Если вы удалите ту часть, в которой мы увеличиваем значение i, то мы получим бесконечный цикл. Как правило – это плохо. Бесконечные циклы известны как логические ошибки, и их нужно избегать. Существует другой способ вырваться из цикла, для этого нужно использовать встроенную функцию break. Давайте посмотрим, как это работает:
```
while i < 10:
    print(i)
    
    if i == 5:
        break
    
    i = i + 1
```
В этой части кода мы добавили условное выражение для проверки того, равняется ли когда-либо переменная i цифре 5. Если нет, тогда мы разрываем цикл. Как вы видите в выдаче кода, как только значение достигает пяти, код останавливается, даже если мы ранее указали while продолжать цикл, пока переменная не достигнет значения 10. Встроенный break также известен как инструмент управления потока. Существует еще один, под названием continue, который в основном используется для пропуска итерации, или перейти к следующей итерации. Вот один из способов его применения:
```
i = 0
while i < 10:
    if i == 3:
        i = i + 1
        continue
    
    print(i)
    if i == 5:
        break
    
    i = i + 1
```
Слегка запутанно, не так ли? Мы добавили второе условное выражение, которое проверяет, не равняется ли i трем. Если да, мы увеличиваем переменную и переходим к следующему циклу, который удачно пропускает вывод значения 3 на экран. Как и ранее, когда мы достигаем значения 5, мы разрываем цикл.

Задачи:
1.	Вводится натуральное число. Найти сумму четных цифр, входящих в его состав.
2. Написать программу, подсчитывающую количество четных и нечетных цифр в чисел
3. Напечатать все цифры числа.
4. Найти сумму первой и последней цифр любого целого положительного числа.
+ Переписать 3 любые задачи с for на while
